;-----------------------------------------------
; ABILITIES - MW CHANGE - ADD PROMOTION POPUP
;-----------------------------------------------

[RoboticChassis X2AbilityTemplate]
LocFriendlyName="机械单位"
LocLongDescription="该单位对火焰和毒伤害免疫，并为相邻盟友提供全掩体。\n不能被精神控制和其他类似的灵能力量影响。"
LocHelpText="该单位对火焰和毒伤害免疫，并为相邻盟友提供全掩体。\n不能被精神控制和其他类似的灵能力量影响。"
LocPromotionPopupText="该单位对火焰和毒伤害免疫，并为相邻盟友提供全掩体。\n不能被精神控制和其他类似的灵能力量影响。"

;-----------------------
; TECHS - BAYS
;-----------------------

[ExpandRepairBay1 X2TechTemplate]
DisplayName="扩展维修间"
Summary="凭借我们对变种人的MEC铸造技术的了解和仓库的移动，我们可以在工程部增加另一个维修间。\n\n这将允许更多的SPARK和机械单位同时维修。"

[ExpandRepairBay2 X2TechTemplate]
;DisplayName="Expand Repair Bay - Again"
DisplayName="扩展维修间"
Summary="凭借我们对变种人的MEC铸造技术的了解和仓库的移动，我们可以在工程部增加另一个维修间。\n\n这将允许更多的SPARK和机械单位同时维修。"

[ExpandRepairBay3 X2TechTemplate]
;DisplayName="Expand Repair Bay - On Last Time"
DisplayName="扩展维修间"
Summary="凭借我们对变种人的MEC铸造技术的了解和仓库的移动，我们可以在工程部增加另一个维修间。\n\n这将允许更多的SPARK和机械单位同时维修。"

[ExpandRepairBay4 X2TechTemplate]
;DisplayName="Expand Repair Bay - You Could Fit A Battlemech In There"
DisplayName="扩展维修间"
Summary="凭借我们对变种人的MEC铸造技术的了解和仓库的移动，我们可以在工程部增加另一个维修间。\n\n这将允许更多的SPARK和机械单位同时维修。"

;-----------------------
; TECHS - CREATION
;-----------------------

[BuildSpark X2TechTemplate]
DisplayName="构建新SPARK"
Summary="使用新的个性矩阵和基线作战数据构建SPARK作战单位。\nSPARK比人类有一个优势：当它们经历灾难性的破坏时，它们不会失去一切。可以恢复数据核心并重建机体。\nSPARK单位不占用复仇者号上的任何生存空间，可以在工程部维修间修复。"

[BuildExpSpark X2TechTemplate]
DisplayName="构建高级SPARK"
Summary="使用新的个性矩阵和高级作战数据构建SPARK作战单位。\nSPARK比人类有一个优势：当它们经历灾难性的破坏时，它们不会失去一切。可以恢复数据核心并重建机体。\nSPARK单位不占用复仇者号上的任何生存空间，可以在工程部维修间修复。"

[RebuildSpark X2TechTemplate]
DisplayName="构建SPARK - 核心重组"
Summary="构建一个SPARK战斗单位并插入一个恢复数据核心。该单位将与其前任具有相同的个性，其获得的经验和军衔将不会丧失。\n然而，SPARK可能需要进行一场战斗来将旧软件校准到新硬件。"

[RM_ConvertMEC X2TechTemplate]
DisplayName="构建SPARK - 回收的MEC残骸"
Summary="SPARK原型由已故的沈博士在大约20年前的首次入侵之前设计，它是未来所有变种人MEC设计的先驱。\n我们可以利用这一点来对抗变种人：有了足够的从战场回收的MEC残骸，我们就可以用组件构建一个SPARK战斗单位，再加上一些额外的补给，我们就可以安装一个新的数据核心。"

[RM_SparkSergeantTech X2TechTemplate]
DisplayName="高级SPARK编码"
Summary="现在我们有了一批经验丰富的士兵和与变种人MEC的遭遇战，我们应该能够利用我们先前任务的作战数据为我们的SPARK单位创造更好的基础。这将使我们能够构建高军衔SPARK投入战斗。"

;-----------------------
; ITEMS - TECH
;-----------------------

[Rusty_RecoverCores X2TechTemplate]
DisplayName="恢复SPARK核心"
Summary="我们搜索到一个来自附近战斗中落下的SPARK数据核心的信标信号。我们几乎可以立即收集。如果我们收集这些核心，就可以用它们来重建阵亡的SPARK。"

[CorpseSPARK X2ItemTemplate]
FriendlyName="<font color='#E67A0E'>SPARK数据核心</font>"
FriendlyNamePlural="<font color='#E67A0E'>SPARK数据核心</font>"
BriefSummary="在战斗中阵亡的XCOM SPARK单位的数据核心。当SPARK被摧毁时，它被送回到复仇者号，紧急弹出装置稍微损坏了它。该数据核心可以插入到试验场的新SPARK中，以恢复SPARK的个性和累积的战斗能力。" 

;-----------------------
; STAFF SLOTS
;-----------------------

[SparkStaffSlot X2StaffSlotTemplate]
EmptyText="开放：需要机械单位"
BonusEmptyText="开始维修机械单位。"
BonusText="机械单位维修中"
FilledText="%UNITNAME 维修中!"
LockedText="未解锁：建造机械单位"

[SparkStaffSlot0 X2StaffSlotTemplate]
EmptyText="开放：需要机械单位"
BonusEmptyText="开始维修机械单位。"
BonusText="机械单位维修中"
FilledText="%UNITNAME 维修中!"
LockedText="未解锁：扩展维修间"

[SparkStaffSlot1 X2StaffSlotTemplate]
EmptyText="开放：需要机械单位"
BonusEmptyText="开始维修机械单位。"
BonusText="机械单位维修中"
FilledText="%UNITNAME 维修中!"
LockedText="未解锁：扩展维修间"

[SparkStaffSlot2 X2StaffSlotTemplate]
EmptyText="开放：需要机械单位"
BonusEmptyText="开始维修机械单位。"
BonusText="机械单位维修中"
FilledText="%UNITNAME 维修中!"
LockedText="未解锁：扩展维修间"

[SparkStaffSlot3 X2StaffSlotTemplate]
EmptyText="开放：需要机械单位"
BonusEmptyText="开始维修机械单位。"
BonusText="机械单位维修中"
FilledText="%UNITNAME 维修中!"
LockedText="未解锁：扩展维修间"

[SparkStaffSlot4 X2StaffSlotTemplate]
EmptyText="开放：需要机械单位"
BonusEmptyText="开始维修机械单位。"
BonusText="机械单位维修中"
FilledText="%UNITNAME 维修中!"
LockedText="未解锁：扩展维修间"

;------------------------------------
; CUSTOM SPARK CLASS SUPPORT
; WITH MW AND MOF TO BUILD HIGHER RANK
;-----------------------------------

[SparkChooseClass X2SoldierClassTemplate]
;DisplayName="选择SPARK"
;ClassSummary="请选择SPARK职业"
LeftAbilityTreeTitle="---"
RightAbilityTreeTitle="---"

RankNames[0]="选择职业"
RankNames[1]="选择职业"
RankNames[2]="选择职业"
RankNames[3]="选择职业"
RankNames[4]="选择职业"
RankNames[5]="选择职业"
RankNames[6]="选择职业"
RankNames[7]="选择职业"

ShortNames[0]="Spk."
ShortNames[1]="Spk."
ShortNames[2]="Spk."
ShortNames[3]="Spk."
ShortNames[4]="Spk."
ShortNames[5]="Spk."
ShortNames[6]="Spk."
ShortNames[7]="Spk."

RankIcons[0]="UILibrary_DLC3Images.rank_squire"
RankIcons[1]="UILibrary_DLC3Images.rank_squire"
RankIcons[2]="UILibrary_DLC3Images.rank_squire"
RankIcons[3]="UILibrary_DLC3Images.rank_squire"
RankIcons[4]="UILibrary_DLC3Images.rank_squire"
RankIcons[5]="UILibrary_DLC3Images.rank_squire"
RankIcons[6]="UILibrary_DLC3Images.rank_squire"
RankIcons[7]="UILibrary_DLC3Images.rank_squire"

